ARMmbed/mbed-os/libraries/mbed/targets/hal/TARGET_Atmel/TARGET_SAM_CortexM4/TARGET_SAMG55J19/PeripheralPins.c
/* mbed Microcontroller Library
 * Copyright (c) 2006-2013 ARM Limited
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "PeripheralPins.h"

/************ADC***************/
const PinMap PinMap_ADC[] = {
    /* Not connected */
    {NC  , NC   , NC}
};

/************DAC***************/
const PinMap PinMap_DAC[] = {
    /* Not connected */
    {NC  , NC   , NC}
};

/************UART***************/
const PinMap PinMap_UART_TX[] = {
    {PA03, UART_3, 0},
    {PA06, UART_2, 0},
    {PA10, UART_0, 0},
    {PA13, UART_5, 0},
    {PA28, UART_7, 1},
    {PB00, UART_6, 1},
    {PB03, UART_1, 0},
    {PB08, UART_4, 0},
    {PB10, UART_4, 0},
    {PB10, UART_6, 1},
    /* Not connected */
    {NC  , NC   , NC}
};

const PinMap PinMap_UART_RX[] = {
    {PA04, UART_3, 0},
    {PA05, UART_2, 0},
    {PA09, UART_0, 0},
    {PA12, UART_5, 0},
    {PA27, UART_7, 1},
    {PB01, UART_6, 1},
    {PB02, UART_1, 0},
    {PB09, UART_4, 0},
    {PB11, UART_4, 0},
    {PB11, UART_6, 1},
    /* Not connected */
    {NC  , NC   , NC}
};

const PinMap PinMap_UART_CTS[] = {
    {PA11, UART_5, 0},
    {PA16, UART_2, 0},
    {PA25, UART_0, 0},
    {PA28, UART_1, 0},
    {PA30, UART_7, 1},
    {PB08, UART_4, 1},
    {PB14, UART_3, 0},
    {PB14, UART_6, 1},
    /* Not connected */
    {NC  , NC   , NC}
};

const PinMap PinMap_UART_RTS[] = {
    {PA15, UART_2, 0},
    {PA26, UART_0, 0},
    {PA29, UART_1, 0},
    {PA31, UART_7, 1},
    {PB02, UART_5, 1},
    {PB09, UART_4, 1},
    {PB15, UART_3, 0},
    {PB15, UART_6, 1},
    /* Not connected */
    {NC  , NC   , NC}
};

/************PWM***************/
const PinMap PinMap_PWM[] = {
    /* Not connected */
    {NC  , NC   , NC}
};





